package by.epam.student.dailid.module1;

public class ex8 {
    public static void main(String[] args) {
        //Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
        double length = 3.15;//длина
        double width = length/2;//ширина
        double square = length*width;//площадь
        System.out.println(square);

    }
}
