package by.epam.dailid.regularexpressions.task1;

import java.util.TreeMap;
import java.util.*;

public class Main {
    //Создать приложение, разбирающее текст(текст хранится в строке), и позволяющее выполнять с текстом три различных
    //операции: отсортировать абзацы по количеству предложений, в каждом предложении отсортировать слова по длине;
    //отсортировать лексемы в предложении по убыванию количества вхождений данного символа, а в случае равенства - по
    //алфавиту
    public static void main(String[] args) {

    }
}


